In [2]:
## Reading Data from Different Sources

import pandas as pd
from io import StringIO
Data='{"employee_name":"James","email":"james@gmail.com","job_profile":[{"title1":"Team Lead","title2":"Full Stack Developer"}]}'
df=pd.read_json(StringIO(Data))

In [3]:
df

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Full Stack ..."

In [5]:
df.to_json()

'{"employee_name":{"0":"James"},"email":{"0":"james@gmail.com"},"job_profile":{"0":{"title1":"Team Lead","title2":"Full Stack Developer"}}}'

In [6]:
df.to_json(orient='index')

'{"0":{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Full Stack Developer"}}}'

In [7]:
df.to_json(orient='records') ## convert into list of answer

'[{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Full Stack Developer"}}]'

In [12]:
df=pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data",header=None)

In [13]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [14]:
df.to_csv("wine.csv")

In [35]:
import requests
import pandas as pd

url = "https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/"
response = requests.get(url)
df_list = pd.read_html(response.text)
df = df_list[0]
print(df.head())

                               Bank Name          City         State   Cert  \
0           The Santa Anna National Bank    Santa Anna         Texas   5520
1                   Pulaski Savings Bank       Chicago      Illinois  28611
2     The First National Bank of Lindsay       Lindsay      Oklahoma   4134
3  Republic First Bank dba Republic Bank  Philadelphia  Pennsylvania  27332
4                          Citizens Bank      Sac City          Iowa   8758

               Acquiring Institution      Closing Date  Fund  Sort ascending
0          Coleman County State Bank     June 27, 2025                 10549
1                    Millennium Bank  January 17, 2025                 10548
2             First Bank & Trust Co.  October 18, 2024                 10547
3  Fulton Bank, National Association    April 26, 2024                 10546
4          Iowa Trust & Savings Bank  November 3, 2023                 10545

C:\Users\anupd\AppData\Local\Temp\ipykernel_15408\2175889669.py:6: FutureWarning: Passing literal html to 'read_html' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  df_list = pd.read_html(response.text)

In [42]:
!pip install html5lib

Requirement already satisfied: html5lib in c:\users\anupd\anaconda3\envs\myenv\lib\site-packages (1.1)
Requirement already satisfied: six>=1.9 in c:\users\anupd\anaconda3\envs\myenv\lib\site-packages (from html5lib) (1.17.0)
Requirement already satisfied: webencodings in c:\users\anupd\anaconda3\envs\myenv\lib\site-packages (from html5lib) (0.5.1)

In [ ]:
import pandas as pd
import requests

url = "https://en.wikipedia.org/wiki/Mobile_country_code"

# Make request with headers
headers = {"User-Agent": "Mozilla/5.0"}
response = requests.get(url, headers=headers)

# Pass the HTML content to pandas
tables = pd.read_html(response.text, match="Country", header=0)
df = tables[0]

print(df.head())

   Mobile country code                                    Country ISO 3166  \
0                  289                                 A Abkhazia    GE-AB
1                  412                                Afghanistan       AF
2                  276                                    Albania       AL
3                  603                                    Algeria       DZ
4                  544  American Samoa (United States of America)       AS

                             Mobile network codes National MNC authority  \
0        List of mobile network codes in Abkhazia                    NaN
1     List of mobile network codes in Afghanistan                    NaN
2         List of mobile network codes in Albania                    NaN
3         List of mobile network codes in Algeria                    NaN
4  List of mobile network codes in American Samoa                    NaN

                    Remarks
0  MCC is not listed by ITU
1                       NaN
2                       NaN
3                       NaN
4                       NaN

C:\Users\anupd\AppData\Local\Temp\ipykernel_15408\4082363245.py:18: FutureWarning: Passing literal html to 'read_html' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  tables = pd.read_html(response.text, match="Country", header=0)

In [50]:
pd.read_excel('output.xlsx')

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida

In [54]:
## pickle file
df_pickle_file=pd.read_excel("output.xlsx")

df_pickle_file.to_pickle('output.xlsx')

In [55]:
df_pickle_file

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida